ERP DEV.WMS/src/InformationRegisters/вмс_РеестрОстаточныхСроковГодности/вмс_РеестрОстаточныхСроковГодности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_РеестрОстаточныхСроковГодности</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПоказательОСГ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_РеестрОстаточныхСроковГодности/Forms/ФормаЗаписиОСГ/Module.bsl
&НаСервере
Процедура ЗаписатьНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
		|	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда	
		Возврат
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.вмс_РеестрОстаточныхСроковГодности.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент); 
	
	НаборЗаписей.Прочитать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Период = ТекущаяДата();
		ЗаписьРегистра.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаписьРегистра.Контрагент = Контрагент;
		ЗаписьРегистра.ПоказательОСГ = ОСГ;     
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда) 
	
	Если НЕ ПроверитьЗаполнение()Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОСГ > 100 Тогда 
		Сообщение = новый СообщениеПользователю;
		Сообщение.Поле = "ОСГ";
		Сообщение.Текст = "ОСГ не может превышать 100";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	
	ЗаписатьНаСервере(); 
	Закрыть();
	
КонецПроцедуры
